icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
        g_ulSystemTimeNanoSeconds = ((g_ulSystemTimeNanoSeconds / SYSTICKNS) *
                                     SYSTICKNS);
    }

    //
    // For each tick, set the next reload value for fine tuning the clock.
    //
    if((g_ulSystemTimeTicks % TICKNS) < g_ulSystemTickHigh)
    {
        SysTickPeriodSet(g_ulSystemTickReload + 1);
    }
    else
    {
        SysTickPeriodSet(g_ulSystemTickReload);
    }

    //
    // Service the PTPd Timer.
    //
    timerTick(SYSTICKMS);

    //
    // Increment the run-time tick counter.
    //
    g_ulSystemTimeTicks++;

    //
    // Clear the SysTick interrupt flag.
    //
    HWREGBITW(&g_ulFlags, FLAG_SYSTICK) = 0;

    //
    // Run the Luminary lwIP system tick.
    //
    lwip_tick(SYSTICKMS);

// Do we want this? each second provide an GPIO output?
//    //
//    // Setup to disable the PPS output on the next pass.
//    //
//    if(HWREGBITW(&g_ulFlags, FLAG_PPSOUT))
//    {
//        //
//        // Setup to turn off the PPS output.
//        //
//        HWREGBITW(&g_ulFlags, FLAG_PPSOUT) = 0;
//        HWREGBITW(&g_ulFlags, FLAG_PPSOFF) = 1;
//    }

    //
    // Check if an RX Packet was received.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_RXPKT))
    {
        //
        // Clear the Rx Packet interrupt flag.
        //
        HWREGBITW(&g_ulFlags, FLAG_RXPKT) = 0;

        //
        // Run the Luminary lwIP system tick, but with no time, to indicate
        // an RX or TX packet has occurred.
        //
        lwip_tick(0);
    }

    //
    // Check if a TX Packet was sent.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_TXPKT))
    {
        //
        // Clear the Tx Packet interrupt flag.
        //
        HWREGBITW(&g_ulFlags, FLAG_TXPKT) = 0;

        //
        // Run the Luminary lwIP system tick, but with no time, to indicate
        // an RX or TX packet has occurred.
        //
        lwip_tick(0);

        //
        // Enable Ethernet TX Packet Interrupts.
        //
        EthernetIntEnable(ETH_BASE, ETH_INT_TX);
    }

    //
    // If IP address has been assigned, initialize the PTPD software (if
    // not already initialized).
    //
    if(HWREGBITW(&g_ulFlags, FLAG_IPADDR) &&
       !HWREGBITW(&g_ulFlags, FLAG_PTPDINIT))
    {
        ptpd_init();
        HWREGBITW(&g_ulFlags, FLAG_PTPDINIT) = 1;
    }

    //
    // If PTPD software has been initialized, run the ptpd tick.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_PTPDINIT))
    {
        ptpd_tick();
    }
}

//*****************************************************************************
//
// Based on the value (adj) provided by the PTPd Clock Servo routine, this
// function will adjust the SysTick periodic interval to allow fine-tuning of
// the PTP Clock.
//
//*****************************************************************************
Boolean
adjFreq(Integer32 adj)
{
    unsigned long ulTemp;

    //
    // Check for max/min value of adjustment.
    //
    if(adj > ADJ_MAX)
    {
        adj = ADJ_MAX;
    }
    else if(adj < -ADJ_MAX)
    {
        adj = -ADJ_MAX;
    }

    //
    // Convert input to nanoseconds / systick.
    //
    adj = adj / SYSTICKHZ;

    //
    // Get the nominal tick reload value and convert to nano seconds.
    //
    ulTemp = (SysCtlClockGet() / SYSTICKHZ) * TICKNS;

    //
    // Factor in the adjustment.
    //
    ulTemp -= adj;

    //
    // Get a modulo count of nanoseconds for fine tuning.
    //
    g_ulSystemTickHigh = ulTemp % TICKNS;

    //
    // Set the reload value.
    //
    g_ulNewSystemTickReload = ulTemp / TICKNS;

    //
    // Return.
    //
    return(TRUE);
}

//*****************************************************************************
//
// This function returns a random number, using the functions in random.c.
//
//*****************************************************************************
UInteger16
getRand(UInteger32 *seed)
{
    unsigned long ulTemp;
    UInteger16 uiTemp;

    //
    // Re-seed the random number generator.
    //
    RandomAddEntropy(*seed);
    RandomSeed();

    //
    // Get a random number and return a 16-bit, truncated version.
    //
    ulTemp = RandomNumber();
    uiTemp = (UInteger16)(ulTemp & 0xFFFF);
    return(uiTemp);
}

//*****************************************************************************
//
// Display Statistics.  For now, do nothing, but this could be used to either
// update a web page, send data to the serial port, or to the OLED display.
//
// Refer to the ptpd software "src/dep/sys.c" for example code.
//
//*****************************************************************************
void
displayStats(RunTimeOpts *rtOpts, PtpClock *ptpClock)
{
}

//*****************************************************************************
//
// Display Date and Time.
//
//*****************************************************************************
static char g_pucBuf[23];
const char *g_ppcDay[7] =
{
    "Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"
};
const char *g_ppcMonth[12] =
{
    "Jan", "Feb", "Mar", "Apr", "May", "Jun",
    "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"
};
